#pragma once

#include "../ECS/ECS.h"

////////////////////////////////////////////////////

/*
	Трасформация, то бишь возможность объекта распологаться 
	на поверхности по координатам x, y благодаря Vector2D "position",
	и его ускорение, тоже по координатам x, y Vector2D "velocity".
*/
#include "Transform.h"

////////////////////////////////////////////////////

/*
	Спрайт объекта. "Просто добавь картинку!"
	Объект со спрайтом обязательно должен иметь месторасположение!
		*Зависим от:
			- Transform
*/
#include "Sprite.h"

////////////////////////////////////////////////////

/*
	Теперь клавиатурой можно управлять объектом WSDA
	Не рекомендую привязывать этот компонент одновременно
	к нескольким объектам, пройзойдет "Разрыв вселенной".
		*Зависим от:
			- Transform
*/
#include "KeyboardController.h"

////////////////////////////////////////////////////

/*
	Объекты с этим компонентом приобретут дополнительную поверхность,
	которая позволит сделать коллизию.
		*Зависим от:
			- Transform
*/
#include "Collider.h"

////////////////////////////////////////////////////

/*

*/
#include "Tile.h"

/*

*/
#include "FixCamera.h"
#include "Projectile.h"

#include "UILabel.h"

#include "ClickUp.h"
#include "ClickDown.h"
#include "Hover.h"



